{	"lines": [		{			"lineID": "idLine",			"text": "ACTUAL TEXT TO USE FOR LINE",			"audioClipID": "ID_OF_AUDIO_CLIP_TO_PLAY_AT_LINE_START",			"animationToPlayID": "ID OF ANIMATION TO PLAY AT LINE START",			"doBeforeLine": "SCRIPT NAME AND PARAMETER TO RUN BEFORE LINE",			"doAfterLine": "SCRIPT NAME AND PARAMETER TO RUN AFTER LINE"		},		{			"lineID": "JaniceFirstGreetingAwakeLine",			"text": "Hey, you're finally awake."		},		{			"lineID": "JaniceFirstGreetingStinkyLine",			"text": "Hey, nice to see you're up and about, big stinky."		},		{			"lineID": "JaniceFirstGreetingInquireLine",			"text": "Been a while, how you doing?"		},		{			"lineID": "JaniceFirstReplyExistLine",			"text": "I sure do exist."		},		{			"lineID": "JaniceFirstReplyReallyLine",			"text": "Am I? Am I really?"		},		{			"lineID": "JaniceFirstReplySassLine",			"text": "No, YOU'RE finally awake."		},		{			"lineID": "JaniceFirstReplyBonesLine",			"text": "And nice to see your bones haven't abandoned you yet, that's an achievement."		},		{			"lineID": "JaniceFirstReplyStinkyLine",			"text": "\"Stinky,\" says the skeleton that drinks vile-smelling beverages for sustenance they don't need."		},		{			"lineID": "JaniceFirstReplyBreathLine",			"text": "Who you calling \"big stinky,\" blood breath?"		},		{			"lineID": "JaniceFirstReplyOkayLine",			"text": "Surprisingly okay, thanks for asking."		},		{			"lineID": "JaniceFirstReplyEmotionlessLine",			"text": "I've never felt an emotion and you know it."		},		{			"lineID": "JaniceResponseInsightLine",			"text": "Wow, real insightful. I almost believed you for a moment."		},		{			"lineID": "JaniceResponseSightLine",			"text": "I mean, probably..? I can see you, which is wild, considering I don't have eyes."		},		{			"lineID": "JaniceResponseBurnLine",			"text": "Oof, you got me there. A scathing burn from which my skin will never recover."		},		{			"lineID": "JaniceResponseStinkyLine",			"text": "I'm calling you \"stinky\" because I may have poor diet choices, but you are literally a rotting corpse."		},		{			"lineID": "JaniceExtraSassLine",			"text": "And, y'know, that makes you stinky. Very stinky. And you're taller than me. Hence... \"big stinky\". Tada."		},		{			"lineID": "JaniceResponseToucheLine",			"text": "I'd say \"touché,\" but I know what I'm about more than you ever will."		},		{			"lineID": "JaniceResponseCandidLine",			"text": "Unsually candid for you, but good, I'm glad!"		},		{			"lineID": "JaniceResponseSureLine",			"text": "Yeah, sure, buddy. You're basically a walking emotion."		},		{			"lineID": "JaniceBanterMeanLine",			"text": "You're so mean to me."		},		{			"lineID": "JaniceBanterLaughLine",			"text": "One day, I'll make you laugh."		},		{			"lineID": "OuchLine",			"text": "Ouch."		},		{			"lineID": "JaniceBanterSincereLine",			"text": "Aww, thank you! What about you, how have you been holding up?"		},		{			"lineID": "JaniceBanterSassLine",			"text": "You're happy that I'm just doing okay? Wow, so uncaring."		},		{			"lineID": "JaniceBanterImMeanLine",			"text": "You don't know what I'm like when I'm mean and you know it."		},		{			"lineID": "JaniceBanterBoneLine",			"text": "Keep dreaming. My funny bone will be forever untickled."		},		{			"lineID": "JaniceBanterSincereReplyLine",			"text": "Things have been going quite well, thanks! Busy as always, but that's to be expected."		},		{			"lineID": "JaniceBanterPersonalityLine",			"text": "There's the Illden I know. Good to know the personality ain't gone."		},		{			"lineID": "JaniceTutorialByTheWayLine",			"text": "By the way, do you know what you're supposed to be doing tonight? Or have you completely forgotten?"		},		{			"lineID": "JaniceTutorialAnywaysLine",			"text": "Anyways, do you know what you're supposed to be doing tonight? Or have you completely forgotten?"		},		{			"lineID": "JaniceTutorialSpeakingOfWhichLine",			"text": "Speaking of which, do you know what you're supposed to be doing tonight? Or have you completely forgotten?"		},		{			"lineID": "YesLine",			"text": "Yes."		},		{			"lineID": "TutorialKnowLine",			"text": "I know exactly what I'm doing."		},		{			"lineID": "TutorialDontKnowLine",			"text": "I have no idea what I'm doing."		},		{			"lineID": "TutorialKindOfKnowLine",			"text": "I mean, I have a rough idea, but I'm not totally sure."		},		{			"lineID": "TutorialNoToTheYesLine",			"text": "...You wanna try that again? 'Cause joking aside, you DO have a job to do."		},		{			"lineID": "TutorialKnowConfirmLine",			"text": "Well, ain't that just dandy! So if I throw you back out there, you'll be fine on your own?"		},		{			"lineID": "TutorialKnowConfidentLine",			"text": "Yup. You should have more faith in me, you know."		},		{			"lineID": "TutorialKnowLiedLine",			"text": "I... was lying."		},		{			"lineID": "TutorialKnowWingItLine",			"text": "I mean, probably not, but I wanna wing it for a while."		},		{			"lineID": "TutorialDontKnowVersionLine",			"text": "Alright, I'm used to preparing the spiel, you've been here many times. You want the short version, the medium version, or the long version?",			"doBeforeLine": "checkLineSeen(TutorialNoToTheYesLine)",			"doAfterLine": "changeNextSet(TutorialYesSassAgainSet)"		},		{			"lineID": "TutorialYesSassAgainLine",			"text": "\"Yes\" me again and I'm gonna be hurling my bony fists your way. I'll detatch 'em and make a flail out of my left arm with 'em, don't test me."		},		{			"lineID": "TutorialLongVersionPleaseLine",			"text": "My brain cells need hydrated with the juice of knowledge. Long version."		},		{			"lineID": "TutorialLongVersionPleaseRetortLine",			"text": "Never say \"juice of knowledge\" like that again."		},		{			"lineID": "UnderstoodLine",			"text": "Understood."		},		{			"lineID": "YouCantAndWontStopMeLine",			"text": "You can't and won't stop me."		},		{			"lineID": "JuiceKnowledgeSassLine",			"text": "But it's The Juuuuuuuice Of Knooooooowledge™! I slurp it in a sippy cup, just to embarrass you further."		},		{			"lineID": "JuiceKnowledgeSassResponseLine",			"text": "Just for that, when the revolution is over, I am personally going to bury you again, but in a casket of mayonnaise this time."		},		{			"lineID": "TutorialMediumVersionPleaseLine",			"text": "I'll probably survive with the medium version."		},		{			"lineID": "TutorialShortVersionPleaseLine",			"text": "Short and sweet so I can inevitably come back to you asking for help later."		},		{			"lineID": "TutorialNarrowDownLine",			"text": "Uh, well, can you narrow down what you actually want from me a little bit, then?"		},		{			"lineID": "TutorialNarrowDownOverviewLine",			"text": "Or do you just want the short version of an overview of what's happening?"		},		{			"lineID": "TutorialNarrowDownReluctantOverviewLine",			"text": "...short overview, please."		},		{			"lineID": "IfYouInsistLine",			"text": "If you insist..."		},		{			"lineID": "DontComeCryingTutorialEndEarlyLine",			"text": "BUT... don't come crying back to me when you can't figure out which way is up, alright?"		},		{			"lineID": "ComeBackBeforeThenTutorialEndLine",			"text": "...Come back way before you reach the point of crying. You're my friend, and even if you're an overly-confident goofball sometimes, I'm here to be here for you."		},		{			"lineID": "ImTrustingYouButAlsoTimingYouLine",			"text": "I'm trusting you on this, but if you come back to me asking for help before even ten minutes have passed..."		},		{			"lineID": "SlapOnTheWristTutorialEndLine",			"text": "...I'll give you a hand. Even if it'd be very in-character for me to laugh at your over-confidence, neither of us benefit from that nastiness."		},		{			"lineID": "ThatsWhatIThoughtLine",			"text": "That's what I thought."		},		{			"lineID": "WhoAreYouLine",			"text": "Who are you?"		},		{			"lineID": "WhoAmILine",			"text": "Who am I?"		},		{			"lineID": "TutorialKindOfJobLine",			"text": "What actually IS my job?"		},		{			"lineID": "TutorialKindOfClownLine",			"text": "Were you a clown, that'd be funny. You're getting a short overview."		},		{			"lineID": "OverviewMedium1Line",			"text": "You're the only undead being that the living will let live above ground."		},		{			"lineID": "OverviewMedium2Line",			"text": "The reason why is... not an actual \"reason\" as much as it's an excuse - bigotry."		},		{			"lineID": "OverviewMedium3Line",			"text": "You bring back the dead that consent to being brought back so we can build up an underground society of our own."		},		{			"lineID": "OverviewMedium4Line",			"text": "Eventually, we'll begin our revolution to gain the same rights as the living."		},		{			"lineID": "OverviewShortLine",			"text": "Go raise the dead that consent to being raised. The revolution depends on it."		},		{			"lineID": "OverviewLong1JuiceLine",			"text": "ANYWAYS... get yourself comfortable. You ask for a long explanation, you're getting the LONG version."		},		{			"lineID": "OverviewLong1Line",			"text": "Alright, get comfortable, buddy. You ask for the long version, you're getting the LONG version."		},		{			"lineID": "OverviewLong2Line",			"text": "You came back from the dead really not long after you died. It was weird."		},		{			"lineID": "OverviewLong3Line",			"text": "The living found you stumbling around the streets in confusion. Because, y'know, you had no idea what was going on."		},		{			"lineID": "OverviewLong4Line",			"text": "They were gonna just rebury you, but instead decided to make you tend the graveyard instead."		},		{			"lineID": "OverviewLong5Line",			"text": "That's about all they let you do, too. You can't live in the town with them - in fact, you can't even go in to it."		},		{			"lineID": "OverviewIntermission1Line",			"text": "Yeah, that's not cool."		},		{			"lineID": "OverviewIntermission2Line",			"text": "If I pretend to snore, will you stop talking?"		},		{			"lineID": "OverviewIntermission3Line",			"text": "People are so rude sometimes."		},		{			"lineID": "OverviewIntermission1ResponseLine",			"text": "Oh, it's so uncool, it's in lava."		},		{			"lineID": "OverviewIntermission2ResponseLine",			"text": "Absolutely not. You signed up for this, and there are no refunds."		},		{			"lineID": "OverviewIntermission3ResponseLine",			"text": "Sometimes? If they don't like you, remove the \"some\" and add \"all\". Alltimes."		},		{			"lineID": "OverviewLong6Line",			"text": "Anyways, humans seem to hate crypt-keeping jobs, so you became the crypt-keeper of their dreams."		},		{			"lineID": "OverviewLong7Line",			"text": "I mean, you don't really do much, 'cause you weren't given any training. But it's a graveyard. And you sure... keep it."		},		{			"lineID": "OverviewLong8Line",			"text": "I found you again eventually, though. Real tearful reunion type-stuff, except neither of us cried, because we can't. So... a regular reunion."		},		{			"lineID": "OverviewLong9Line",			"text": "We got to talkin', and we decided that we deserved better than the cards we'd been dealt. We needed to make a change. A big one."		},		{			"lineID": "OverviewLong10Line",			"text": "But a revolution can't happen in a day, now, can it? Not to mention being at a disadvantage in a world not built for us."		},		{			"lineID": "OverviewLong11Line",			"text": "We need names and numbers. Advocates for carcasses. Cadaver campaigners. Supernatural supporters. Punny posters of alliterative appeal."		},		{			"lineID": "OverviewLong12Line",			"text": "So far, we have... a fourteen-year-old ghost who is basically babysat, and a furry werewolf."		},		{			"lineID": "TellMeAboutTheGhostLine",			"text": "What's the deal with the ghost?"		},		{			"lineID": "TellMeAboutTheWerewolfLine",			"text": "Uh, can I ask about the \"furry\" werewolf?"		},		{			"lineID": "TellMeAboutOurResidentsLine",			"text": "You have me intrigued. Tell me more about them."		},		{			"lineID": "TellMeAboutNeitherLine",			"text": "I'm sure they're lovely, but I don't really wanna hear about them right now."		},		{			"lineID": "OverviewLongGhost1Line",			"text": "Eh, not actually all that sure. They seem really nice, but they spend a lot of time playing in their own ectoplasm."		},		{			"lineID": "OverviewLongGhost2Line",			"text": "Turns out, ectoplasm happens when a ghost cries. Found that out when I caught them crying once."		},		{			"lineID": "OverviewLongGhost3Line",			"text": "They seem to cry a lot, but that's just how it is sometimes. They miss living on the surface, but don't want to haunt anyone."		},		{			"lineID": "OverviewLongGhost4Line",			"text": "Things can be rough, so I let them know it's okay to cry. And they apologised for the mess, but I told them not to worry about it."		},		{			"lineID": "OverviewLongGhost5Line",			"text": "I made you clean it up."		},		{			"lineID": "OverviewLongWerewolf1Line",			"text": "You sure can, but I don't know much myself. They insist on being called \"Hunter, Moon\" every time. With the comma."		},		{			"lineID": "OverviewLongWerewolf2Line",			"text": "They're actually very lovely, though. And when they're in the werewolf form, very fluffy."		},		{			"lineID": "OverviewLongWerewolf3Line",			"text": "Petting them is a nice way to relax and pass the time, and when I asked them if they mind it, they said they don't."		},		{			"lineID": "OverviewLongWerewolf4Line",			"text": "I told them to let me know if that ever changes, though. Don't assume because something is true now, it'll be true in the future."		},		{			"lineID": "OverviewLongWerewolf5Line",			"text": "Still not used to cleaning up all the shedded fur. Made you sweep that up once, but that was a bad time to find out you had allergies."		},		{			"lineID": "OverviewLongResidents1Line",			"text": "Oh, they're both lovely. You've met them, you just won't remember it."		},		{			"lineID": "OverviewLongResidents2Line",			"text": "Which is a shame, because they both think you're chill. Clearly, you're the fan favourite out of both of us."		},		{			"lineID": "OverviewLongResidents3Line",			"text": "They're both a little too good at making a mess, but they're so nice I don't really care about cleanup duty."		},		{			"lineID": "OverviewLongResidents4Line",			"text": "I just make you do it."		},		{			"lineID": "OverviewLongNeither1Line",			"text": "Well, they'd be real disappointed to hear you care that little about 'em."		},		{			"lineID": "OverviewLongNeither2Line",			"text": "But if you insist, I'll continue with the rest of this overly-long running monologue."		},		{			"lineID": "OverviewLongImpatientLine",			"text": "Okay, I know I said I wanted the long version, but I was not aware you'd be telling me my entire unlife story. Please wrap it up."		},		{			"lineID": "OverviewLongImpatientResponseLine",			"text": "The point is that we're not enough for a revolution. Four people isn't a revolution. It's a starting point at best, a literature club at worst."		},		{			"lineID": "OverviewLongImpatienceResponseJokeFollowupLine",			"text": "Don't get me wrong, I love a good book, but I've seen some real bad things happen in literature clubs."		},		{			"lineID": "OverviewLongGhostResponseNiceLine",			"text": "Aww, that ghost seems like a real sweetheart. Hopefully they're okay with the whole \"being dead\" thing overall."		},		{			"lineID": "OverviewLongGhostResponsePunLine",			"text": "That ghost seems to have had a real bad case of the BOOs, huh?"		},		{			"lineID": "OverviewLongWerewolfResponseNiceLine",			"text": "They seem like a really nice person! I hope they've been good with lending you a hand around the place."		},		{			"lineID": "OverviewLongWerewolfResponsePunLine",			"text": "If I know you at all, I'd bet that you were HOWLING with laughter when you saw I was allergic."		},		{			"lineID": "OverviewLongResidentsResponseNiceLine",			"text": "I hope they've not been giving you too much trouble, beyond making messes."		},		{			"lineID": "OverviewLongResidentsResponsePunLine",			"text": "At least they're not frustrating you. It'd be real bad if you didn't get along with our skeleton crew."		},		{			"lineID": "OverviewLongResidentsGhostReplyNiceLine",			"text": "Yeah, they're pretty happy with it all, and enjoy being incorporeal. They just get lonely sometimes."		},		{			"lineID": "OverviewLongResidentsGhostReplyPunLine",			"text": "Being real with you, if you do or say anything to that ghost to upset them, I will personally shave my fingerbones and throw the dust in what's left of your eyes. That is not a threat; it's a promise. Capiche?"		},		{			"lineID": "OverviewLongResidentWerewolfReplyNiceLine",			"text": "Oh yeah, they're a wonderful help in so many of the physical ways that we're useless in. Having both feet, skin, and being tall are certainly nice traits for those that have 'em."		},		{			"lineID": "OverviewLongResidentWerewolfReplyPunLine",			"text": "Yeah. I was. What you gonna do about it? Cry? Because if so I'm sorry because I value our friendship more than jokes that are coming across as cruelty."		},		{			"lineID": "OverviewLongResidentsReplyNiceLine",			"text": "Definitely not, they're both good company. The ghost's a decent cleaner when they're not crying, and the werewolf is a great practical helper."		},		{			"lineID": "OverviewLongResidentsReplyPunLine",			"text": "...make another pun like that and I will show you a brand new definition of fear. It involves a lot of birds, a hammock, and thirty pounds of yungo. You don't want to know what yungo is."		},		{			"lineID": "OverviewLong13Line",			"text": "Anyways, in case you hadn't figured, we're not enough. Four people isn't a revolution, it's a nuisance at best. At worst, a sad party."		},		{			"lineID": "OverviewLong14Line",			"text": "But here's the thing, and it's gonna seem unrelated at first, so hear me out."		},		{			"lineID": "OverviewLong15Line",			"text": "Nobody knows how you came back. You fully died, dead as a doornail, and you came back, but NOBODY knows how."		},		{			"lineID": "OverviewLong16Line",			"text": "I don't know, the ghost doesn't -- not even the humans with their fancy-pantsy Science™ and Alchemy™ know."		},		{			"lineID": "OverviewLong17Line",			"text": "From the humans' immediate hatred, disgust, and disdain of you, I doubt they're even looking to find out."		},		{			"lineID": "OverviewLong18Line",			"text": "My theory is that you - somehow, keep in mind I have no clue how - you raised yourself from the dead."		},		{			"lineID": "OverviewLong19Line",			"text": "Might sound a bit out there, and by \"a bit\" I mean it sounds like it's on Farcliff Mountain, but the thing is... you can raise others, too."		},		{			"lineID": "FlatWhatLine",			"text": "What."		},		{			"lineID": "SoundsFakeButOkayLine",			"text": "Sounds fake, but okay."		},		{			"lineID": "JaniceFlatWhatResponseLine",			"text": "'Ey, no thinking I'm a liar allowed, I KNOW you can raise others."		},		{			"lineID": "JaniceSoundsFakeResponseLine",			"text": "Sounds fake, yeah, it totally does, but it ain't."		},		{			"lineID": "JaniceYoureLiterallyAZombieLine",			"text": "On many other occasions, I'd agree with you, it's ridiculous. I don't quite get the confusion this time, though, considering you are literally a zombie."		},		{			"lineID": "GoodPointWellMadeLine",			"text": "...Good point, well-made."		},		{			"lineID": "OverviewLong20Line",			"text": "You're the one that brought back the ghost, y'know. I know, you don't remember it, but you did, I was there."		},		{			"lineID": "OverviewLong21Line",			"text": "They wanted to come back, and so did you. And so you both came back."		},		{			"lineID": "OverviewLong22Line",			"text": "...I mean, you came back first, obviously, but the point is you both came back."		},		{			"lineID": "OverviewLong23Line",			"text": "You, my friend, my dear friend Illden, my dearest dear of a pal Illden Young... are a necromancer."		},		{			"lineID": "OverviewLong24Line",			"text": "And not just any necromancer, nah, that'd be boring and pretty unethical. You raise the dead that don't want to be dead. You only raise the dead that WANTED to be undead."		},		{			"lineID": "OverviewLong25Line",			"text": "You're about as close to an ethical and natural necromancer as it gets which is - professionally speaking - incredibly freakin' cool."		},		{			"lineID": "ImAWhatLine",			"text": "I'm a... what?"		},		{			"lineID": "BestLifeOfMyUnlifeLine",			"text": "An ETHICAL necromancer? ME?! This is the best life of my unlife."		},		{			"lineID": "JaniceImAWhatReplyLine",			"text": "You're a 'mancer, Illden."		},		{			"lineID": "OverviewLong26Line",			"text": "Don't get me wrong, though, you ain't special. I mean, not as far as the idea of you being the only one that's ever been an ethical necromancer."		},		{			"lineID": "OverviewLong27Line",			"text": "Like, I know of at least a dozen other people in history who either definitely were or were at least rumoured to be ethical necromancers."		},		{			"lineID": "OverviewLong28Line",			"text": "So you ain't \"the chosen one\" or anything - there have been more in the years before, and there will be more long into the future."		},		{			"lineID": "OverviewLong29Line",			"text": "In fact, you're pretty much an amateur... at best. Being generous, here."		},		{			"lineID": "OverviewLong30Line",			"text": "BUT... I don't know of another something, living or unliving, that's like you."		},		{			"lineID": "OverviewLong31Line",			"text": "So you may not be THE chosen one, but you are OUR \"chosen one\"... to go and raise the dead so we can beef up numbers for an undead revolution."		},		{			"lineID": "GetTheGistLine",			"text": "Okay, I think I get the gist of what's going on. Thanks!"		},		{			"lineID": "StillCluelessButOkayLine",			"text": "I still have no idea what's going on but I'm sure I'll figure it out eventually."		},		{			"lineID": "StoppedPayingAttentionAWhileAgoLine",			"text": "Oh, uh, I zoned out a while ago. What am I supposed to do?"		},		{			"lineID": "TEMPENDLine",			"text": "NOW FUCK OFF. (This is a temporary end line, which means you successfully reached the end of the conversation without breaking my game. Try to break it.)"		}	]}